import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Describe","AssetId","Transform","SexType"],["","","","",""],[1,"双层翅膀","334814",["0","0","0","0","0","90","1","1","1"],0],[2,"翅膀","135851",["0","0","0","0","0","90","1","1","1"],0],[3,"翅膀","452702",["0","0","0","0","0","90","1","1","1"],0],[4,"翅膀","449687",["0","0","0","0","0","90","1","1","1"],0],[5,"翅膀","449694",["0","0","0","0","0","90","1","1","1"],0],[6,"翅膀","375152",["0","0","0","0","0","90","1","1","1"],0],[7,"六翼翅膀","399002",["0","0","0","0","0","90","1","1","1"],0],[8,"飞行背包","131208",["-6","0","-123","0","0","90","1","1","1"],0],[9,"小熊背包","454815",["0","0","0","0","0","0","1","1","1"],0],[10,"小熊背包","454822",["0","0","0","0","0","0","1","1","1"],0],[11,"小熊背包","454833",["0","0","0","0","0","0","1","1","1"],0],[12,"小熊背包","454834",["0","0","0","0","0","0","1","1","1"],0],[13,"棺材","117847",["0","0","-132","0","0","90","1","1","1"],0]];
export interface IBackElement extends IElementBase{
 	/**undefined*/
	ID:number
	/**undefined*/
	Describe:string
	/**undefined*/
	AssetId:string
	/**undefined*/
	Transform:Array<string>
	/**0-Common
1-Male
2-FeMale*/
	SexType:number
 } 
export class BackConfig extends ConfigBase<IBackElement>{
	constructor(){
		super(EXCELDATA);
	}

}